In [2]:
import mysql.connector

In [3]:
phone_pe=mysql.connector.connect(
        host="127.0.0.1",
        user="root",
        password='Sandy@1630',
        auth_plugin="mysql_native_password")

In [1]:
import pandas as pd
df=pd.read_csv("data aggregated transaction.csv")
#df

In [5]:
mycursor=phone_pe.cursor()
mycursor.execute("USE phonepe")
sq1="CREATE TABLE ATransaction(MyIndex int NOT NULL AUTO_INCREMENT ,State varchar(50),Year int,Quater int,Transaction_type varchar(255),Transaction_count bigint,Transaction_amount bigint,PRIMARY KEY(MyIndex))"
mycursor.execute(sq1)
print('Table created successfully')

Table created successfully

In [7]:
for index,row in df.iterrows():
    quer="INSERT INTO phonepe.ATransaction(State,Year,Quater,Transaction_type,Transaction_count,Transaction_amount)values(%s,%s,%s,%s,%s,%s)"
    mycursor.execute(quer,(row.State,row.Year,row.Quater,row.transaction_type ,row.Transaction_count,row.transaction_amount))
print("dataframe inserted successfully")
phone_pe.commit()

dataframe inserted successfully

In [4]:
mycursor=phone_pe.cursor()

In [16]:
import pandas as pd
df1=pd.read_csv('data aggregater_user1.csv')

In [7]:
mycursor=phone_pe.cursor()
mycursor.execute('USE phonepe')
sq2='CREATE TABLE Ausers_1(MyIndex int NOT NULL AUTO_INCREMENT,State varchar(255),Year int,Quater int,Brand varchar(100),Count int,Percentage float,PRIMARY KEY (MyIndex))'
mycursor.execute(sq2)
print("TABLE CREATED SUCCESSFULLY")

TABLE CREATED SUCCESSFULLY

In [18]:
for index,row in df1.iterrows():
    query="INSERT INTO phonepe.Ausers_1(State,Year,Quater,Brand,Count,Percentage) VALUES(%s,%s,%s,%s,%s,%s)"
    mycursor.execute(query,(row.State,row.Year,row.Quater,row.Brand,row.Count_,row.Percentage_))
print("dataframe inserted successfully")
phone_pe.commit()

dataframe inserted successfully

In [7]:
#df2=pd.read_csv('data map_transaction.csv')
#df2

In [35]:
sq3="CREATE TABLE Map_transaction(MyIndex int NOT NULL AUTO_INCREMENT,State varchar(100),Year int,Quater int,District varchar(255),Count bigint,Amount bigint,PRIMARY KEY(MyIndex))"
mycursor.execute(sq3)
print("table created")

table created

In [36]:
for index,row in df2.iterrows():
    query="INSERT INTO phonepe.Map_transaction(State,Year,Quater,District,Count,Amount) values(%s,%s,%s,%s,%s,%s)"
    mycursor.execute(query,(row.State,row.Year,row.Quater,row.district,row.Count,row.Amount))

In [37]:
phone_pe.commit()

In [5]:
#df3=pd.read_csv("df_map_user.csv")

In [12]:
sq3="CREATE TABLE if not exists MAP_users(MyIndex INT NOT NULL AUTO_INCREMENT,State VARCHAR(100),Year INT, Quater INT, District VARCHAR(100),RegisteredUsers BIGINT , PRIMARY KEY (MyIndex))"
mycursor.execute(sq3)

In [8]:
for index,row in df3.iterrows():
    query="INSERT INTO phonepe.MAP_users(State,Year,Quater,District,RegisteredUsers) values(%s,%s,%s,%s,%s)"
    mycursor.execute(query,(row.State,row.Year,row.Quater,row.District,row.RegisteredUsers))
phone_pe.commit()

In [6]:
#import pandas as pd
#df=pd.read_csv('data Top_transaction1.csv')
#df

In [42]:
df.isnull().sum()

Unnamed: 0            0
State                 0
Year                  0
Quater                0
District              4
Transaction_count     0
Transaction_amount    0
dtype: int64

In [12]:
mycursor.execute("USE phonepe")
mycursor.execute("CREATE TABLE Top_transaction1(MyIndex int NOT NULL AUTO_INCREMENT,State varchar(255),Year int,Quater int,District bigint,Transaction_count bigint,Transaction_amount bigint,PRIMARY KEY(MyIndex))")
print("table created successfully")

table created successfully

In [8]:
for index,row in df.iterrows():
    quer="INSERT INTO phonepe.Top_transaction1(State,Year,Quater,District,Transaction_count,Transaction_amount) values(%s,%s,%s,%s,%s,%s)"
    mycursor.execute(quer,(row.State,row.Year,row.Quater,row.District,row.Transaction_count,row.Transaction_amount))
print("inserted successfully")
phone_pe.commit()

inserted successfully

In [10]:
df=pd.read_csv("data Top_user.csv")
df

,Unnamed: 0,State,Year,Quater,District,RegisteredUsers
0,0,andaman-&-nicobar-islands,2018,1,744103,1608
1,1,andaman-&-nicobar-islands,2018,1,744101,1108
2,2,andaman-&-nicobar-islands,2018,1,744105,1075
3,3,andaman-&-nicobar-islands,2018,1,744102,1006
4,4,andaman-&-nicobar-islands,2018,1,744104,272
...,...,...,...,...,...,...
28555,28555,west-bengal,2022,4,700015,108457
28556,28556,west-bengal,2022,4,742304,105471
28557,28557,west-bengal,2022,4,721101,105279
28558,28558,west-bengal,2022,4,700091,102363
28559,28559,west-bengal,2022,4,700150,101966

In [15]:
mycursor.execute("USE phonepe")
sql="CREATE TABLE if not exists top_user1(State varchar(255),Year int,Quater int,District int,RegisteredUsers int)"
mycursor.execute(sql)
print('table created successfully')

table created successfully

In [16]:
for index,row in df.iterrows():
    quer='INSERT INTO phonepe.top_user1(State,Year,Quater,District,RegisteredUsers) values(%s,%s,%s,%s,%s)'
    mycursor.execute(quer,(row.State,row.Year,row.Quater,row.District,row.RegisteredUsers))
print('inserted successfully')
phone_pe.commit()

inserted successfully

In [1]:
import pandas as pd
df=pd.read_csv('data Top_transaction1.csv')
df.isnull().sum()

Unnamed: 0            0
State                 0
Year                  0
Quater                0
District              4
Transaction_count     0
Transaction_amount    0
dtype: int64

In [2]:
df.fillna(method='ffill',inplace=True)

In [3]:
df.isnull().sum()

Unnamed: 0            0
State                 0
Year                  0
Quater                0
District              0
Transaction_count     0
Transaction_amount    0
dtype: int64